[
  {
    "job_id": 82989580,
    "job_title": "2026 DXC Technology Graduate Program - Business Pathways",
    "company_name": "GradConnection",
    "salary": null,
    "location": "Adelaide SA",
    "description": "Our Graduate Program is designed for graduates who are looking to join an agile world leader and are ready to use the power of technology to deliver m",
    "industry_type": "(Banking & Financial Services)",
    "sub_classification": "Banking - Business",
    "highlights": null,
    "job_url": "https://www.seek.com.au/job/82989580?type=standard&ref=search-standalone&origin=cardTitle#sol=9296e6a65352fc568ecb1d1f36824d2ddd4b09ae",
    "job_type": "Full time",
    "job_details": "{\"Our Graduate Program is designed for talented, passionate graduates who are looking to join an agile world leader and are ready to use the power of technology to deliver mission critical IT services that move the world.\nWhat’s in it for you?\n\nA stimulating 12-month program with a company that is well positioned to grow and deliver true innovation and value to our customers\nOpportunities to collaborate with senior leaders on various projects\nOngoing training and development\nA dedicated people manager and buddy to help guide and support you from Day 1\nA variety of social and cultural activities to extend your networking and team building skills\n\nGraduate opportunities:\n\nBusiness Analyst - Bridge the gap between IT and the business using analysis to support business decisions\nConsulting (Business) - Collaborate with our clients to improve their business through DXC’s offerings and expertise\nConsulting (Technical) - Collaborate with our clients to improve their business through DXC’s offerings and expertise\nProject Management - Plan, manage, oversee and lead customer projects to completion\nSales Professional - Generate business opportunities with current and future clients\nService Delivery Coordinator - Coordinate service delivery for our clients’ critical applications\n\nWhat we’re looking for?\nTo be eligible for our Graduate Program, when submitting your application, you must be:\n\nA New Zealand citizen or Permanent Resident\nHave completed all course requirements for your university degree or Polytechnic diploma no earlier than November 2023, and must be expecting to complete all course requirements for your degree no later than February 2026\n\nAll degrees are accepted. We invite you to join our passionate team and thrive with DXC.\nDXC is an equal opportunity employer. We welcome the many dimensions of diversity. To increase diversity in the technology industry, we encourage applications by all – including Māori and/or Pasifika people, neurodiverse people, and members of the LGBTQIA+ community. Accommodation of special needs for qualified candidates may be considered within the framework of the DXC Accommodation Policy. In addition, DXC Technology is committed to working with and providing reasonable accommodation to qualified individuals with physical and mental disabilities.\"}",
    "job_posting_time": "10d ago",
    "company_size": null,
    "company_description": null,
    "job_rating": 0.0,
    "number_of_reviews": "0",
    "date_scraped": "02-04-2025 21:21",
    "classified_job": "(Banking & Financial Services)",
    "updated_category": "(Banking & Financial Services)",
    "Unnamed: 20": null,
    "extracted_tools_str": "Go, R",
    "extracted_soft_skills_str": "Leadership, Teamwork, Teamwork, Critical Thinking",
    "extracted_programming_languages_str": "TypeScript, C, Go, R",
    "extracted_methods_frameworks_str": "Agile, Project Management",
    "industry_sector": "Please provide the job description, and I'll respond with the most likely industry sector."
  },
  {
    "job_id": 83356563,
    "job_title": "Technical Business Analyst - Power Platform",
    "company_name": "KPMG",
    "salary": "Our people build skills for the future",
    "location": "Sydney NSW",
    "description": "Conduct end-to-end testing of Power Platform applications to ensure solution stability, usability, and performance",
    "industry_type": "(Information & Communication Technology)",
    "sub_classification": "Business/Systems Analysts",
    "highlights": "{\"Come as you are and shape a better future through work that matters\",\"We acknowledge and celebrate the cultural diversity of our people\",\"Join an organisation where you will thrive\"}",
    "job_url": "https://www.seek.com.au/job/83356563?type=standard&ref=search-standalone&origin=cardTitle#sol=4d1478e3dbac989e7ccc558fe1f518a0dcfc3503",
    "job_type": "Full time",
    "job_details": "{\"Job DescriptionOur Enterprise Technology Advisory team brings together skills in intelligent automation, data engineering and software integration to help our clients align their technology capabilities with their strategic and operational objectives. We also draw on KPMG’s extensive national and global resources, adopting a multidisciplinary approach to help unlock the full potential of existing and new technology investments.CC supports care and health providers, specifically in disability, aged care and community services. The software functions span customer management, workforce management, mobile care delivery and claims & payments with significant industry extensions to comply with quality standards and funding rules.Your OpportunityAs a member of our Community Care team, the Technical Business Analyst will play a crucial role by:Conduct end-to-end testing of Power Platform applications (including Power Automate workflows, Canvas Apps, and custom pages) to ensure solution stability, usability, and performance.Develop and execute testing protocols, including regression testing, load testing, and user acceptance testing (UAT) tailored to Power Platform environments.Document business workflows, technical specifications, and user guides across all components of the Power Platform to ensure accurate, up-to-date system documentation.Support end-user training and onboarding efforts by contributing to knowledge bases, walkthroughs, and support materials.Collaborate with project teams to understand business needs and ensure functionality aligns with real-world use cases.How are you Extraordinary?You are able to quickly build strong relationships and network with a variety of stakeholders both internal and external.You are passionate about the importance of fantastic communication to share ideas, inspire, and create change. You are able to digest, distil, and communicate complex concepts in both written and verbal forms.Your ExperienceYou thrive in a collaborative and innovative culture and want to join a firm that values problem solvers, the kind of people who reimagine the possible for their clients and key stakeholders. We are looking for people in this role with a passion for and / or experience in the following areas:Demonstrated experience in testing and documenting Power Platform applications, especially Power Apps, Power Automate, and custom pages.Strong understanding of compliance, data governance, and real-world testing scenarios relevant to human services sectors.Exceptional analytical thinking, attention to detail, and problem-solving abilities.Excellent communication and technical writing skills — capable of producing clear, user-friendly documentation for both technical and non-technical audiences.Familiarity with tools such as DevOps, SharePoint, or Confluence is a plus.   Additional InformationKPMG is a professional services firm with global outreach and deep sector experience. We work with clients across an array of industries to solve complex challenges, steer change and enable growth. Our people are what make KPMG the thriving workplace that it is and what sets us apart is that we know great minds think differently. Collaborate with a team of passionate, highly skilled professionals who’ve got your back. You’ll build relationships with unique and diverse colleagues who will provide you with the support you need to be your best and produce meaningful and impactful work in an inclusive, equitable culture.At KPMG, you’ll take control over how you work. We’re embracing a new way of working in many ways, from offering flexible hours and locations to generous paid parental leave and career breaks. Our people enjoy a variety of exciting perks, including retail discounts, health and wellbeing initiatives, learning and growth opportunities, salary packaging options and more.Diverse candidates have diverse needs. During your recruitment journey, information will be provided about adjustment requests. If you require additional support before submitting your application, please contact the Talent Attraction Support Team.At KPMG every career is different, and we look forward to seeing how you grow with us.\"}",
    "job_posting_time": "10d ago",
    "company_size": "Not Found",
    "company_description": null,
    "job_rating": 3.2,
    "number_of_reviews": "212 reviews",
    "date_scraped": "18-04-2025 12:34",
    "classified_job": "Technology",
    "updated_category": "Technology",
    "Unnamed: 20": null,
    "extracted_tools_str": "Power Platform, DevOps, SharePoint, Confluence",
    "extracted_soft_skills_str": "Communication, Teamwork, Problem-solving, Analytical Thinking, Documentation, Testing, Technical Writing, Teamwork, Adaptability, User Guides, Training, Documentation",
    "extracted_programming_languages_str": "TypeScript, C, Ruby, Go, R",
    "extracted_methods_frameworks_str": "Testing, DevOps, Power Platform",
    "industry_sector": "Technology"
  },
  {
    "job_id": 82989575,
    "job_title": "2026 DXC Technology Graduate Program - Business Pathways",
    "company_name": "GradConnection",
    "salary": null,
    "location": "Melbourne VIC",
    "description": "Our Graduate Program is designed for graduates who are looking to join an agile world leader and are ready to use the power of technology to deliver m",
    "industry_type": "(Banking & Financial Services)",
    "sub_classification": "Banking - Business",
    "highlights": null,
    "job_url": "https://www.seek.com.au/job/82989575?type=standard&ref=search-standalone&origin=cardTitle#sol=355f942a3a4ff65b5d7bcd5409db08f236459252",
    "job_type": "Full time",
    "job_details": "{\"Our Graduate Program is designed for talented, passionate graduates who are looking to join an agile world leader and are ready to use the power of technology to deliver mission critical IT services that move the world.\nWhat’s in it for you?\n\nA stimulating 12-month program with a company that is well positioned to grow and deliver true innovation and value to our customers\nOpportunities to collaborate with senior leaders on various projects\nOngoing training and development\nA dedicated people manager and buddy to help guide and support you from Day 1\nA variety of social and cultural activities to extend your networking and team building skills\n\nGraduate opportunities:\n\nBusiness Analyst - Bridge the gap between IT and the business using analysis to support business decisions\nConsulting (Business) - Collaborate with our clients to improve their business through DXC’s offerings and expertise\nConsulting (Technical) - Collaborate with our clients to improve their business through DXC’s offerings and expertise\nProject Management - Plan, manage, oversee and lead customer projects to completion\nSales Professional - Generate business opportunities with current and future clients\nService Delivery Coordinator - Coordinate service delivery for our clients’ critical applications\n\nWhat we’re looking for?\nTo be eligible for our Graduate Program, when submitting your application, you must be:\n\nA New Zealand citizen or Permanent Resident\nHave completed all course requirements for your university degree or Polytechnic diploma no earlier than November 2023, and must be expecting to complete all course requirements for your degree no later than February 2026\n\nAll degrees are accepted. We invite you to join our passionate team and thrive with DXC.\nDXC is an equal opportunity employer. We welcome the many dimensions of diversity. To increase diversity in the technology industry, we encourage applications by all – including Māori and/or Pasifika people, neurodiverse people, and members of the LGBTQIA+ community. Accommodation of special needs for qualified candidates may be considered within the framework of the DXC Accommodation Policy. In addition, DXC Technology is committed to working with and providing reasonable accommodation to qualified individuals with physical and mental disabilities.\"}",
    "job_posting_time": "10d ago",
    "company_size": null,
    "company_description": null,
    "job_rating": 0.0,
    "number_of_reviews": "0",
    "date_scraped": "02-04-2025 16:22",
    "classified_job": "(Banking & Financial Services)",
    "updated_category": "(Banking & Financial Services)",
    "Unnamed: 20": null,
    "extracted_tools_str": "Go, R",
    "extracted_soft_skills_str": "Leadership, Teamwork, Creativity, Critical Thinking, Teamwork",
    "extracted_programming_languages_str": "TypeScript, C, Go, R",
    "extracted_methods_frameworks_str": "Agile",
    "industry_sector": "Technology"
  },
  {
    "job_id": 83351611,
    "job_title": "Senior Business Analyst - Fixed Term Contract",
    "company_name": "Culture Kings",
    "salary": null,
    "location": "Brisbane QLD",
    "description": "Lead discovery workshops with senior stakeholders to understand business goals, pain points, and desired future states Document current and future ...",
    "industry_type": "(Information & Communication Technology)",
    "sub_classification": "Business/Systems Analysts",
    "highlights": null,
    "job_url": "https://www.seek.com.au/job/83351611?type=standard&ref=search-standalone&origin=cardTitle#sol=388bcaf9b8171f2faabfd969125a695ddf657725",
    "job_type": "Contract/Temp",
    "job_details": "{\"\nKey Responsibilites\nLead discovery workshops with senior stakeholders to understand business goals, pain points, and desired future states\nDocument current and future state processes, including cross-functional process mapping, capability models, and impact assessments\nElicit and document business, functional, and non-functional requirements that are clear, testable, and actionable\nCollaborate with architects and delivery leads to shape solution design and roadmap decisions\nValidate requirements through prototyping, storyboarding, and vendor analysis\nContribute to change impact assessments, communication plans, and training needs in partnership with the change management team\nSupport QA teams by reviewing test cases, participating in UAT, and confirming traceability from requirements to test coverage\nEngage with vendors and third parties to align external solutions with internal objectives as needed\n\n\"}",
    "job_posting_time": "10d ago",
    "company_size": "Not Found",
    "company_description": null,
    "job_rating": 3.7,
    "number_of_reviews": "53 reviews",
    "date_scraped": "18-04-2025 13:34",
    "classified_job": "Consulting",
    "updated_category": "Consulting",
    "Unnamed: 20": null,
    "extracted_tools_str": "Go, R",
    "extracted_soft_skills_str": "Communication, Teamwork",
    "extracted_programming_languages_str": "TypeScript, C, Go, R",
    "extracted_methods_frameworks_str": null,
    "industry_sector": "Please provide the job description, and I'll do my best to determine the most likely industry sector."
  },
  {
    "job_id": 83355591,
    "job_title": "Senior Business Analyst",
    "company_name": "Australian Vintage Limited",
    "salary": null,
    "location": "Cowandilla, Adelaide SA",
    "description": "Seeking a Senior Business Analyst for a 6 month temp to perm opportunity",
    "industry_type": "(Information & Communication Technology)",
    "sub_classification": "Business/Systems Analysts",
    "highlights": "{\"Values-driven culture and flexible work environment\",\"Competitive benefits offering, including paid parental leave & birthday leave!\",\"ASX listed, global wine business\"}",
    "job_url": "https://www.seek.com.au/job/83355591?type=standard&ref=search-standalone&origin=cardTitle#sol=4cf53595af923d6f7f00e3b57f5170e8b56391fc",
    "job_type": "Contract/Temp",
    "job_details": "{\"About AV:Australian Vintage (AV) is an ASX-listed company and the proud owner of the multi-award-winning McGuigan, Tempus Two, Nepenthe, and Barossa Valley Wine Company brands. Leveraging our world-class assets and innovative expertise, we are dedicated to delivering exceptional results. As a certified B Corporation, Australian Vintage is committed to making a positive impact on both people and the planet through continuous improvement and by using business as a force for good. We have set an ambitious Net Zero 2040 emissions target, are powered by renewable energy, and ensure all our owned and operated vineyards and wineries are certified under Sustainable Wine guidelines. We support our people to make an impact where they live through paid volunteer days and are proud to be recognised as an accredited Mental Health First Aid workplace by Mental Health First Aid Australia as of January 2023.About the role:We’re looking for an experienced and proactive Senior Business Analyst to join our IT team for a 6-month temporary role with the potential to go permanent. In this unique dual role, you’ll lead key digital transformation projects across the business, acting as both Business Analyst and Project Manager. You’ll work closely with stakeholders from all areas of the organisation—including Digital Marketing, eCommerce, Corporate, and more—to align business needs with technology solutions and drive real improvements across systems and processes.This is a fantastic opportunity for someone who thrives in a fast-paced environment, enjoys variety in their work, and is ready to take ownership of strategic initiatives that make a difference. What you’ll do:Reporting to the CIO your primary duties will include:Lead end-to-end delivery of digital transformation projects, from planning and stakeholder engagement through to execution and post-implementation reviewsWork closely with business units to gather requirements, define business objectives, and develop user stories and documentationMap and improve processes to support simplification, automation, and alignment with strategic goalsRun weekly project meetings and keep stakeholders informed with clear updates, action items, and follow-upsSupport change management activities including communication plans, training support, and solution adoptionAnalyse project and business performance data to provide actionable insights and ensure delivery of key outcomesProvide escalated support for IT applications and work with IT to implement long-term solutionsWhat you'll bring:You have at least 5 years’ experience as a Business Analyst, ideally with some project management exposureYou’re confident leading workshops, facilitating discussions, and turning business needs into structured, actionable outcomesYou’ve worked with ERP systems (JD Edwards, Oracle preferred) and ideally have exposure to tools like Shopify, Airtable, Salesforce, or Power BIYou’re known for your clear communication, relationship-building, and ability to get things done in cross-functional environmentsYou’re solutions-focused, collaborative, and comfortable managing multiple moving parts at onceYou hold a relevant tertiary qualification in Business, IT, or similar, and have Business Analysis or PM certificationsWhat we offer:We're proud to offer a strong benefits package that we know can make a big difference to work life and life outside of work.Primary carer parental leave offering 26 weeks paid leaveLoyalty leave‘Work anywhere’ for up to two weeks annuallyBirthday leaveVolunteer daysFurther education and study supportFlexible workingMental health and wellbeing training and supportAnnual product allowanceOptions to purchase additional annual leaveSabbaticals and career breaksContinuation of superannuation while on paid and unpaid parental leaveIf you’re a strategic thinker with a passion for driving transformation and making a real impact, we’d love to hear from you. Apply now to join a values-led business that’s shaping the future of wine, technology, and sustainability—one project at a time.\"}",
    "job_posting_time": "10d ago",
    "company_size": "Not Found",
    "company_description": null,
    "job_rating": 2.8,
    "number_of_reviews": "11 reviews",
    "date_scraped": "18-04-2025 13:54",
    "classified_job": "Banking Insurance General Financial Services",
    "updated_category": "Banking Insurance General Financial Services",
    "Unnamed: 20": null,
    "extracted_tools_str": "JD Edwards, Oracle, Shopify, Salesforce, Power BI, Git, Salesforce",
    "extracted_soft_skills_str": "Communication, Leadership, Adaptability, Project management",
    "extracted_programming_languages_str": "TypeScript, C, Go, R, Scala",
    "extracted_methods_frameworks_str": "Project Management, Business Analysis",
    "industry_sector": "Please provide the job description, and I'll respond with the most likely industry sector."
  }
]